chayuto/ws-ESP32-S3-Touch-AMOLED-1.8/projects/02_word_book_en/sdkconfig.defaults
# Board: Waveshare ESP32-S3-Touch-AMOLED-1.8 (ESP32-S3R8, 16 MB quad flash, 8 MB OPI PSRAM)
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB, QIO. The eFuse on this unit reports quad (4 data lines).
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM: 8 MB octal, in-package, 80 MHz. LVGL draw buffers live here
# (the BSP sets buff_spiram = true) — 368x448 RGB565 is 330 KB per full frame.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Full 240 MHz. Without this ESP-IDF boots the S3 at 160 MHz — the vendor's own
# 00_board_check defaults omit it, which cost us a confused first boot.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Console over the native USB-Serial/JTAG peripheral (GPIO 19/20).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 1 ms tick keeps LVGL's animation and input timing smooth.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# An LVGL app overflows the default 1 MB app partition.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Fonts used by this template.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# ESP-SR: MultiNet7 English from the `model` partition; no WakeNet model selected
# on purpose (the AFE is created with wakenet_init = false). NS and VAD stay on
# the WebRTC defaults for now.
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y

# Big word on the text cards.
CONFIG_LV_FONT_MONTSERRAT_48=y

# Book files are named by word (dog.rgb565); FAT 8.3 cannot hold that extension.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Word book: self-test on for development builds. Turn off for the toy.
CONFIG_WORDBOOK_BOOT_SELFTEST=y


# Clock: RTC + optional NTP. Wi-Fi credentials never go here - see
# sdkconfig.defaults.local (gitignored) and "Credential pattern" in CLAUDE.md.
CONFIG_WORDBOOK_NTP=y

# Display memory: cards.c brings the panel up itself with a 20-line draw buffer in
# internal DMA RAM (14.7 KB), so SPI flushes never need a bounce buffer. The BSP's
# own bsp_display_start() puts the buffer wherever MALLOC_CAP_DEFAULT lands it,
# which under RAM pressure meant PSRAM plus a failing bounce allocation and a
# frozen screen. Do not go back to it.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Internal RAM is the scarce resource once Wi-Fi is up alongside the recogniser
# (maintenance mode measured 6 KB minimum free with the defaults). Smaller pools:
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_TCP_WND_DEFAULT=5760
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Logging, agentic first: DEBUG is compiled in for everything, the default stays at
# INFO so third-party components do not flood, and app_main raises this project's
# own tags to DEBUG at boot. Serial 'd' switches every tag to DEBUG at runtime.
# See .claude/skills/agentic-logging. The SD flight recorder mirrors all of it.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=n
# The system event task logs Wi-Fi/netif lines at DEBUG; 2.3 KB overflowed.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
